|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [23]:
df= pd.read_csv(r'..\..\titanic_dataset.csv')

In [59]:
df.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [15]:
#Command to search dir for relevant functions
list(filter(lambda x: x.find('run')+1,dir(os)))

['ftruncate', 'truncate']

In [20]:
%%bash

ls ../../titanic*

../../titanic_dataset.csv

In [38]:
df.describe(include= "object")

,name,gender,ticket,fare,cabin,embarked,boat,home.dest
count,1309,1309,1309,1308,295,1307,486,745
unique,1307,2,929,263,186,3,27,369
top,"Kelly, Mr. James",male,CA. 2343,$8.05,C23 C25 C27,S,13,"New York, NY"
freq,2,843,11,60,6,914,39,64

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1309 non-null   int64
 1   pclass      1309 non-null   int64
 2   survived    1309 non-null   int64
 3   name        1309 non-null   object
 4   gender      1309 non-null   object
 5   age         1046 non-null   float64
 6   sibsp       1309 non-null   int64
 7   parch       1309 non-null   int64
 8   ticket      1309 non-null   object
 9   fare        1308 non-null   object
 10  cabin       295 non-null    object
 11  embarked    1307 non-null   object
 12  boat        486 non-null    object
 13  body        121 non-null    float64
 14  home.dest   745 non-null    object
dtypes: float64(2), int64(5), object(8)
memory usage: 153.5+ KB

In [35]:
#- Find columns with missingdata
df.columns[df.isna().any(axis=0)]
#df.isna().any(axis=0).index
df.columns[df.count()<df.shape[0]]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [39]:
# Print shape of dataset
df.shape

(1309, 15)

In [56]:
# drop columns with more than 25% missing data
thresh = 0.75*1309
df.dropna(axis=1, thresh = thresh).columns

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

In [48]:
df.isna().sum(axis=0)/1309*100

Unnamed: 0     0.000000
pclass         0.000000
survived       0.000000
name           0.000000
gender         0.000000
age           20.091673
sibsp          0.000000
parch          0.000000
ticket         0.000000
fare           0.076394
cabin         77.463713
embarked       0.152788
boat          62.872422
body          90.756303
home.dest     43.086325
dtype: float64

In [60]:
# drop columns having independent values(which do not affect the survival rate).
df.drop(columns = ['Unnamed: 0', 'name', 'body', 'ticket', 'boat']).T

,0,1,2,3,4,5,6,7,8,9,...,1299,1300,1301,1302,1303,1304,1305,1306,1307,1308
pclass,1,1,1,1,1,1,1,1,1,1,...,3,3,3,3,3,3,3,3,3,3
survived,1,1,0,0,0,1,1,0,1,0,...,0,1,0,0,0,0,0,0,0,0
gender,female,male,female,male,female,male,female,male,female,male,...,male,female,male,male,male,female,female,male,male,male
age,29,0.9167,2,30,25,48,63,39,53,71,...,27,15,45.5,NaN,NaN,14.5,NaN,26.5,27,29
sibsp,0,1,1,1,1,0,1,0,2,0,...,1,1,0,0,0,1,1,0,0,0
parch,0,2,2,2,2,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
fare,$211.34,$151.55,$151.55,$151.55,$151.55,$26.55,$77.96,$0.00,$51.48,$49.50,...,$14.45,$14.45,$7.23,$7.23,$14.46,$14.45,$14.45,$7.23,$7.23,$7.88
cabin,B5,C22 C26,C22 C26,C22 C26,C22 C26,E12,D7,A36,C101,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
embarked,S,S,S,S,S,S,S,S,S,C,...,C,C,C,C,C,C,C,C,C,S
home.dest,"St Louis, MO","Montreal, PQ / Chesterville, ON","Montreal, PQ / Chesterville, ON","Montreal, PQ / Chesterville, ON","Montreal, PQ / Chesterville, ON","New York, NY","Hudson, NY","Belfast, NI","Bayside, Queens, NY","Montevideo, Uruguay",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [62]:
# check data types of all columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1309 non-null   int64
 1   pclass      1309 non-null   int64
 2   survived    1309 non-null   int64
 3   name        1309 non-null   object
 4   gender      1309 non-null   object
 5   age         1046 non-null   float64
 6   sibsp       1309 non-null   int64
 7   parch       1309 non-null   int64
 8   ticket      1309 non-null   object
 9   fare        1308 non-null   object
 10  cabin       295 non-null    object
 11  embarked    1307 non-null   object
 12  boat        486 non-null    object
 13  body        121 non-null    float64
 14  home.dest   745 non-null    object
dtypes: float64(2), int64(5), object(8)
memory usage: 153.5+ KB

In [77]:
df.nunique().index

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body',
       'home.dest'],
      dtype='object')

In [97]:
dfx= pd.concat([df.nunique(), df.dtypes], axis=1)

dfx.rename(mapper={0: 'Count', 1:'DType'}, axis=1,inplace=True)

dfx[dfx["DType"]==object].sort_values(by="Count", ascending=True)

           Count   DType
embarked       3  object
boat          27  object
cabin        186  object
fare         263  object
home.dest    369  object
ticket       929  object
name        1307  object

In [95]:
list(filter(lambda x: x.find("Catego")+1,dir(pd)))

['Categorical', 'CategoricalDtype', 'CategoricalIndex']

In [99]:
df["gender"]=pd.Categorical(df["gender"])
df["embarked"]= pd.Categorical(df["embarked"])
df["boat"]= pd.Categorical(df["boat"])

In [116]:
# convert price to numeric

df["new_fare"]= df.fare.apply(lambda x: float(x[1:]) if isinstance(x,str) else x )

In [120]:
df.sample

Object `df.choice` not found.

In [121]:
df[["fare", "new_fare"]].sample(20)

          fare  new_fare
437    $65.00      65.00
916    $13.42      13.42
19     $75.24      75.24
999     $7.75       7.75
395    $23.00      23.00
1269    $9.50       9.50
1161    $8.05       8.05
1104   $39.69      39.69
843    $19.97      19.97
1137    $7.23       7.23
1120    $7.78       7.78
28    $135.63     135.63
987     $7.88       7.88
913     $7.80       7.80
722     $7.50       7.50
1262   $14.50      14.50
98    $106.43     106.43
781     $7.90       7.90
454    $13.00      13.00
39     $50.50      50.50

In [127]:
# find columns still having missing/na values and also count of missing data
df.drop("fare", axis=1, inplace=True)
df.isna().sum(axis=0)

KeyError: "['fare'] not found in axis"

In [130]:
print(df.isna().sum(axis=0)/df.shape[0])
df.dropna(axis=1, thresh= 0.75 * df.shape[0],inplace=True)
print(df.isna().sum(axis=0)/df.shape[0])

Unnamed: 0    0.000000
pclass        0.000000
survived      0.000000
name          0.000000
gender        0.000000
age           0.200917
sibsp         0.000000
parch         0.000000
ticket        0.000000
cabin         0.774637
embarked      0.001528
boat          0.628724
body          0.907563
home.dest     0.430863
new_fare      0.000764
dtype: float64
Unnamed: 0    0.000000
pclass        0.000000
survived      0.000000
name          0.000000
gender        0.000000
age           0.200917
sibsp         0.000000
parch         0.000000
ticket        0.000000
embarked      0.001528
new_fare      0.000764
dtype: float64

In [142]:
print(df.isna().sum(axis=0))

Unnamed: 0      0
pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
embarked        2
fare            1
dtype: int64

In [132]:
# fill na with mean for fare and age column column.
df.rename(columns={"new_fare":"fare"},inplace=True)

In [140]:
df[df["fare"].isna() | df["age"].isna()]

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,embarked,fare
15,15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,S,25.93
37,37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,S,26.55
40,40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,C,39.60
46,46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,S,31.00
59,59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,C,27.72
...,...,...,...,...,...,...,...,...,...,...,...
1293,1293,3,0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,S,8.05
1297,1297,3,0,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,S,7.25
1302,1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,C,7.23
1303,1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,C,14.46
1305,1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,C,14.45

In [143]:
df[["fare", "age"]].fillna(df[["fare", "age"]].mean()).iloc[15] #confirms correct filling of na value

fare    25.930000
age     29.881135
Name: 15, dtype: float64

In [146]:
df["age"].mean() #confirms that the age matches with the mean

29.8811345124283

In [147]:
df[["fare", "age"]]= df[["fare", "age"]].fillna(df[["fare", "age"]].mean())

In [149]:
df.isna().sum(axis=0)

Unnamed: 0    0
pclass        0
survived      0
name          0
gender        0
age           0
sibsp         0
parch         0
ticket        0
embarked      2
fare          0
dtype: int64

In [150]:
# drop na values for embarked column.
df.dropna(inplace=True)

In [151]:
df.isna().sum(axis=0)# YOu can see all N/As are gone

Unnamed: 0    0
pclass        0
survived      0
name          0
gender        0
age           0
sibsp         0
parch         0
ticket        0
embarked      0
fare          0
dtype: int64

In [153]:
df.shape #2 rows and 4 columns have been removed from the original data set

(1307, 11)

In [154]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.

df.to_csv("titanic_filtered.csv")

In [156]:
df.survived.value_counts()

0    809
1    498
Name: survived, dtype: int64

In [157]:
# for surviced column replace 0 with D and 1 with A

df["survived"].replace({0:'D' , 1:'A'}).value_counts()

D    809
A    498
Name: survived, dtype: int64

In [158]:
df["survived"].replace({0:'D' , 1:'A'},inplace=True)

In [160]:
df.survived.value_counts()

D    809
A    498
Name: survived, dtype: int64

In [161]:
# find the frequency of different values in survived column
df.survived.value_counts()

D    809
A    498
Name: survived, dtype: int64

In [177]:
# group by gender and survived and see the counts in each category
a= df.groupby(by = ["gender"])["survived"].value_counts()

In [181]:
a.name= "Count" # Because "survived" is already a name for df column
a.reset_index()

In [184]:
# find different pclass and no of people in each class

df["pclass"].value_counts().sort_index()

1    321
2    277
3    709
Name: pclass, dtype: int64

In [186]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
df[["name", "age", "gender"]].sort_values(by="age", ascending=False).head(5)

                                                   name   age  gender
14                 Barkworth, Mr. Algernon Henry Wilson  80.0    male
61    Cavendish, Mrs. Tyrell William (Julia Florence...  76.0  female
1235                                Svensson, Mr. Johan  74.0    male
135                           Goldschmidt, Mr. George B  71.0    male
9                               Artagaveytia, Mr. Ramon  71.0    male

In [188]:
df[["name", "age", "gender"]].sort_values(by="age", ascending=False).head(5)["gender"].value_counts()

male      4
female    1
Name: gender, dtype: int64

In [191]:
# find max age male and female who survived
df[df["survived"]=='A'].groupby("gender")['age'].agg(np.max)

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [192]:
# get average age by gender
df.groupby("gender")['age'].agg(np.mean)

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [193]:
# get average age by people survived vs not-survived
df.groupby("survived")["age"].agg(np.mean)

survived
A    28.974711
D    30.389368
Name: age, dtype: float64